[
  {
    "courseId": "6356d1117050a7181c5c671d",
    "categoryId": 0,
    "price": "$3,621.65",
    "picture": "https://www.freecodecamp.org/news/content/images/size/w2000/2021/06/javascriptfull.png",
    "rating": 4.0,
    "students": 41003,
    "instructor": "Hensley Combs",
    "courseName": "The Complete JavaScript Course",
    "about": "The modern JavaScript course for everyone! Master JavaScript with projects, challenges and theory. Many courses in one!Become an advanced, confident, and modern JavaScript developer from scratch.Become job-ready by understanding how JavaScript really works behind the scenes.JavaScript fundamentals: variables, if/else, operators, boolean logic, functions, arrays, objects, loops, strings, etc.\r\n",
    "overview": [
      "Learn modern tools that are used by professional web developers: NPM, Parcel (module bundler), Babel, and ES6 modules",
      "How JavaScript works behind the scenes: engines, the call stack, hoisting, scoping, the 'this' keyword, reference values, and more.",
      "Deep dive into functions: arrow functions, first-class and higher-order functions, bind, and closures."
    ]
  },
  {
    "courseId": "6356d11111a3c82ccfe799f0",
    "categoryId": 1,
    "price": "$2,985.83",
    "picture": "https://www.freecodecamp.org/news/content/images/size/w2000/2022/10/alex-chumak-zGuBURGGmdY-unsplash.jpg",
    "rating": 4.6,
    "students": 12594,
    "instructor": "Reese Ball",
    "courseName": "Python for Data Science and Machine Learning",
    "about": "Learn how to use NumPy, Pandas, Seaborn , Matplotlib , Plotly , Scikit-Learn , Machine Learning, Tensorflow , and more!Use Python for Data Science and Machine Learning.Implement Machine Learning Algorithms.Use Plotly for interactive dynamic visualizations.Natural Language Processing and Spam Filters\r\n",
    "overview": [
      "Programming with Python",
      "NumPy with Python",
      "Using pandas Data Frames to solve complex tasks",
      "Use matplotlib and seaborn for data visualizations",
      "Machine Learning with SciKit Learn, including"
    ]
  },
  {
    "courseId": "6356d111ebbc43d469aca8b8",
    "categoryId": 5,
    "price": "$1,018.15",
    "picture": "https://www.freecodecamp.org/news/content/images/size/w2000/2022/09/FreeCodeCamp.png",
    "rating": 4.2,
    "students": 28090,
    "instructor": "Stacey Knapp",
    "courseName": "The Ultimate MySQL Bootcamp",
    "about": "This course was just completely redone and rebuilt from the ground up, with over 325 brand new videos recorded. The course now uses MySQL 8.x and covers new topics including: Window Functions, Views, and SQL modes.If you want to learn how to gain insights from data but are too intimidated by databases to know where to start, then this course is for you. This course is a gentle but comprehensive introduction to MySQL, one of the most highly in-demand skills in the business sector today.  \r\n",
    "overview": [
      "Learn the ins and outs of SQL syntax",
      "Generate reports using sales and user data",
      "Analyze data using Aggregate Functions",
      "Run complex queries using MySQL logical operators and string functions",
      "Design and implement complex database schemas"
    ]
  },
  {
    "courseId": "6356d1119bdcf39dd0d78ad8",
    "categoryId": 2,
    "price": "$1,804.10",
    "picture": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
    "rating": 4.9,
    "students": 39576,
    "instructor": "Vinson Stephens",
    "courseName": "The Complete iOS App Development Bootcamp",
    "about": "Welcome to the Complete iOS App Development Bootcamp. With over 39,000 5 star ratings and a 4.8 average my iOS course is the HIGHEST RATED iOS Course in the history of Udemy!At 55+ hours, this iOS 13 course is the most comprehensive iOS development course online!This Swift 5.1 course is based on our in-person app development bootcamp in London, where we've perfected the curriculum over 4 years of in-person teaching.Our complete app development bootcamp teaches you how to code using Swift 5.1 and build beautiful iOS 13 apps for iPhone and iPad. Even if you have ZERO programming experience.\r\n",
    "overview": [
      "Concepts of Object Oriented Programming (OOP): The type system, variables, functions and methods, inheritance, structures, classes and protocols.",
      "Control Structures: Using If ­Else clauses, Switch statements and logic to control the flow of execution.",
      "How to Implement In-App Purchases with Apple StoreKit",
      "Augmented Reality: How to create 3D objects in augmented reality and create incredible 3D animations and real-life interactions using Apple's latest ARKit2 framework."
    ]
  },
  {
    "courseId": "6356d111d0dbea25b7ea2c7e",
    "categoryId": 4,
    "price": "$3,743.81",
    "picture": "https://www.freecodecamp.org/news/content/images/size/w2000/2022/03/The-Complete-Guide-to-Understanding-and-Using-REST-APIs.png",
    "rating": 4.7,
    "students": 30912,
    "instructor": "Bonnie Fox",
    "courseName": "Rest API Testing (Automation) from Scratch-Rest Assured Java",
    "about": "REST Assured API is powerful API released by google (just like Selenium for Web)  to Automate REST API's.  70% of the IT industry now heading towards this API for automating Services.Learn Everything You Need to Know About REST API Automation including Postman Even If You've Never worked Before on API's.Course covers Basics To Advanced Level With Rest Assured, Postman, Java, TestNG, Framework Implementation From Scratch with rich examples like Jira, Twitter, Youtube, Google Maps API examples\r\n",
    "overview": [
      "Understanding the REST API architecture",
      "Terminologies such as Endpoint, Resources,Payload,Parameters",
      "Setting up REST ASSURED environment for automation",
      "Methods to validate Json and xpath responses",
      "Serialization & Deserialization for Json inputs and outputs"
    ]
  },
  {
    "courseId": "6356d1115841362e10db60c1",
    "categoryId": 0,
    "price": "$3,928.76",
    "picture": "https://images.unsplash.com/photo-1516321318423-f06f85e504b3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
    "rating": 4.9,
    "students": 2564,
    "instructor": "Dana Morse",
    "courseName": "The Complete Web Developer in 2022",
    "about": "Just Updated for 2022! Become a Fullstack Web Developer by learning the most in demand skills!  Graduates of this course are now working at companies like Google, Tesla, Amazon, Apple, Shopify, JP Morgan, Facebook + other top tech companies (...seriously).Join a live online community of over 600,000+ developers and a course taught by an industry expert that has actually worked both in Silicon Valley and Toronto as a Senior Developer and Tech Lead.\r\n",
    "overview": [
      "Build real complex applications and websites",
      "Build an image recognition app so you can add it to your portfolio",
      "Be able to go off on your own and grow your skills as a developer, having built a solid foundation",
      "Build your own startup landing page"
    ]
  },
  {
    "courseId": "6356d111da34aab13b5b0f4e",
    "categoryId": 3,
    "price": "$2,878.95",
    "picture": "https://www.freecodecamp.org/news/content/images/size/w2000/2021/03/youtube-cover.jpg",
    "rating": 4.4,
    "students": 33292,
    "instructor": "Trina Oneal",
    "courseName": "Complete C# Unity Game Developer 3D",
    "about": "This is the long-awaited sequel to the Complete Unity Developer - one of the most popular e-learning courses on the internet! Completely re-worked from scratch with brand-new projects and our latest teaching techniques. You will benefit from the fact we have already taught over a million students programming and game development, many shipping commercial games as a result.Unity is an incredible 3D package used for making video games, architectural and medical imaging and more. The challenge is that it's big and complicated to use, especially for complete beginners to coding and game development. We make learning to code easy and fun by leading you step-by-step through the process of creating exciting games.\r\n",
    "overview": [
      "Be challenged to build the entire game yourself.",
      "Be shown step-by step how to build it.",
      "Be challenged to apply, and re-apply your knowledge regularly.",
      "Art asset creation (assets provided but not made on-screen).",
      "Physics engine modification."
    ]
  },
  {
    "courseId": "6356d1110874083e201a4a38",
    "categoryId": 0,
    "price": "$3,129.49",
    "picture": "https://res.cloudinary.com/practicaldev/image/fetch/s--3zWuwYa3--/c_imagga_scale,f_auto,fl_progressive,h_900,q_auto,w_1600/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pdib9r9rk5j1m7oala1p.png",
    "rating": 4.3,
    "students": 23431,
    "instructor": "Dee Horn",
    "courseName": "React - The Complete Guide",
    "about": "This course is fully up-to-date with React 18 (the latest version of React)!It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know!This course also comes with two paths which you can take: The complete path (full >40h course) and the summary path (~4h summary module) - you can choose the path that best fits your time requirements! \r\n",
    "overview": [
      "A thorough introduction to React.js (What is it and why would you use it?)",
      "Components, props & dynamic data binding",
      "Working with user events and state to create interactive applications",
      "React Hooks (in-depth)!",
      "Working with built-in Hooks and building custom Hooks"
    ]
  },
  {
    "courseId": "6356d111d6d1756cfd2df869",
    "categoryId": 1,
    "price": "$3,053.42",
    "picture": "https://cdn-media-2.freecodecamp.org/w1280/5f9c9d09740569d1a4ca358a.jpg",
    "rating": 4.7,
    "students": 5582,
    "instructor": "Diaz Massey",
    "courseName": "R For Data Science With Real Exercises",
    "about": "Learn R Programming by doing!There are lots of R courses and lectures out there. However, R has a very steep learning curve and students often get overwhelmed. This course is different!This course is truly step-by-step. In every new tutorial we build on what had already learned and move one extra step forward.After every video, you learn a new valuable concept that you can apply right away. And the best part is that you learn through live examples.\r\n",
    "overview": [
      "Learn how to use R Studio",
      "Learn the core principles of programming",
      "Learn how to create variables",
      "Learn about integer, double, logical, character, and other types in R",
      "Learn how to create a while() loop and a for() loop in R"
    ]
  },
  {
    "courseId": "6356d111a657a2948885bd60",
    "categoryId": 2,
    "price": "$3,872.62",
    "picture": "https://yfcampus.com/yfc_media/2019/10/Android-app-Development.jpg",
    "rating": 4.0,
    "students": 37607,
    "instructor": "Vickie Faulkner",
    "courseName": "The Complete Android N Developer Course",
    "about": "Please note support for this course has now stopped, and that there is a newer version of the course (The Complete Android Oreo Developer Course) available.In this Android N version of the course I use Android Studio versions 2.0 and 2.1.2, and recommend students do the same.Building on last year’s runaway success: The Complete Android Developer Course (Udemy’s best-ever-selling Android course, with over 50,000 happy students), The Complete Android N Developer Course has been refined, honed and microscopically polished to deliver even more valuable content, all designed for the latest Android 7. \r\n",
    "overview": [
      "Time-tested, quick-to-pick up learning strategies",
      "Quality insider tips, that only the pros normally know",
      "Home-based learning—so you can go as fast or slow as you please",
      "Simple, jargon-free language and HD definition"
    ]
  }
]
