[
  {
    "courseId": "6356d1117050a7181c5c671d",
    "categoryId": 0,
    "price": "$3,621.65",
    "picture": "http://placehold.it/32x32",
    "rating": 4.01,
    "students": 41003,
    "instructor": "Hensley Combs",
    "courseName": "The Complete JavaScript Course",
    "about": "Esse sint consequat quis in dolore voluptate ut officia id. Laboris culpa aute in minim duis. Ipsum tempor deserunt enim veniam. Amet ad ullamco cillum duis Lorem. Fugiat dolore incididunt amet elit eu aute minim nostrud duis velit deserunt consequat reprehenderit exercitation. Consectetur veniam sit irure qui nostrud Lorem labore veniam.\r\n",
    "releaseDate": "2015-07-10T10:49:32 -06:00",
    "overview": [
      "commodo enim non ex commodo id nulla laboris",
      "consectetur quis aliqua id incididunt consequat commodo duis",
      "consectetur ex exercitation laboris ea aliqua sit sint",
      "deserunt dolore irure irure nisi incididunt id Lorem",
      "consequat id proident ullamco ex aliqua id deserunt"
    ]
  },
  {
    "courseId": "6356d11111a3c82ccfe799f0",
    "categoryId": 1,
    "price": "$2,985.83",
    "picture": "http://placehold.it/32x32",
    "rating": 4.66,
    "students": 12594,
    "instructor": "Reese Ball",
    "courseName": "Python for Data Science and Machine Learning",
    "about": "Amet exercitation ea sit quis labore aliquip ea ex laborum cillum adipisicing velit veniam sunt. Incididunt deserunt nulla laboris cillum commodo. Tempor ex ullamco ipsum veniam incididunt velit reprehenderit nulla consequat occaecat nulla incididunt quis. Duis sit amet cillum enim labore nulla tempor non occaecat laboris. Nisi quis adipisicing Lorem eu et id tempor mollit eu labore sunt consequat magna.\r\n",
    "releaseDate": "2017-05-08T04:19:30 -06:00",
    "overview": [
      "deserunt irure duis ea dolor esse mollit eiusmod",
      "fugiat culpa quis culpa proident laboris duis esse",
      "excepteur magna incididunt sit mollit non duis sunt",
      "aute aliqua culpa adipisicing eu exercitation laboris consequat",
      "amet eiusmod ad nulla ea nisi in consequat"
    ]
  },
  {
    "courseId": "6356d111ebbc43d469aca8b8",
    "categoryId": 5,
    "price": "$1,018.15",
    "picture": "http://placehold.it/32x32",
    "rating": 4.2,
    "students": 28090,
    "instructor": "Stacey Knapp",
    "courseName": "The Ultimate MySQL Bootcamp",
    "about": "Magna est reprehenderit commodo laborum cillum sint do adipisicing enim. Est nulla enim incididunt minim culpa consectetur eiusmod nulla. Velit anim labore aliquip qui do amet eu. Officia amet incididunt aliqua aliquip. Ut reprehenderit voluptate cupidatat pariatur adipisicing aliquip elit commodo irure adipisicing mollit ea.\r\n",
    "releaseDate": "2021-07-07T07:02:55 -06:00",
    "overview": [
      "mollit fugiat elit Lorem sit eu eiusmod dolore",
      "officia consequat laboris non proident laborum velit eu",
      "aliquip eiusmod dolore occaecat proident irure Lorem consequat",
      "commodo eiusmod incididunt minim dolore aliqua exercitation sint",
      "ad nulla ipsum nisi culpa dolore fugiat aliqua"
    ]
  },
  {
    "courseId": "6356d1119bdcf39dd0d78ad8",
    "categoryId": 2,
    "price": "$1,804.10",
    "picture": "http://placehold.it/32x32",
    "rating": 4.93,
    "students": 39576,
    "instructor": "Vinson Stephens",
    "courseName": "The Complete iOS App Development Bootcamp",
    "about": "Labore esse velit duis aute aliqua do nostrud amet amet elit labore sit ad. Occaecat exercitation ut exercitation veniam deserunt pariatur. Nulla ad eu minim eu reprehenderit sit non nisi nostrud sunt reprehenderit sint ut consequat. Eiusmod nostrud pariatur cupidatat incididunt aliquip consequat. Do eiusmod do ipsum esse nulla nulla aliquip ea irure duis commodo magna.\r\n",
    "releaseDate": "2016-07-22T05:31:33 -06:00",
    "overview": [
      "magna qui adipisicing amet eu ut in duis",
      "quis veniam nostrud sunt dolor cillum ipsum aliquip",
      "sunt do elit laboris labore irure ipsum exercitation",
      "voluptate cillum dolor laborum Lorem ad est qui",
      "exercitation irure eiusmod ex occaecat nulla officia culpa"
    ]
  },
  {
    "courseId": "6356d111d0dbea25b7ea2c7e",
    "categoryId": 4,
    "price": "$3,743.81",
    "picture": "http://placehold.it/32x32",
    "rating": 4.78,
    "students": 30912,
    "instructor": "Bonnie Fox",
    "courseName": "Rest API Testing (Automation) from Scratch-Rest Assured Java",
    "about": "Irure nostrud nostrud magna nostrud incididunt amet veniam tempor aute tempor laborum voluptate cillum. Anim dolor ea consectetur pariatur non elit excepteur consectetur incididunt in laborum exercitation. Laborum laborum amet magna fugiat cupidatat proident officia enim ad esse aliqua esse ea aute. Occaecat aute qui aute exercitation duis. Deserunt culpa officia aute qui amet elit. Sint sint est in occaecat anim dolor fugiat ea incididunt cupidatat elit est dolor sint.\r\n",
    "releaseDate": "2016-03-05T12:56:23 -06:00",
    "overview": [
      "sint voluptate eu sunt deserunt veniam eiusmod non",
      "quis consequat duis sit eiusmod aute ullamco occaecat",
      "ea minim veniam minim officia eiusmod laborum aliqua",
      "do laboris ullamco elit pariatur sint nulla labore",
      "id labore fugiat culpa cillum consequat culpa magna"
    ]
  },
  {
    "courseId": "6356d1115841362e10db60c1",
    "categoryId": 0,
    "price": "$3,928.76",
    "picture": "http://placehold.it/32x32",
    "rating": 4.91,
    "students": 2564,
    "instructor": "Dana Morse",
    "courseName": "The Complete Web Developer in 2022",
    "about": "Ea aute fugiat dolore enim excepteur fugiat ex adipisicing voluptate deserunt eiusmod. Et officia dolore ipsum consequat mollit adipisicing exercitation est proident tempor. Velit pariatur Lorem dolore adipisicing ut qui deserunt id consequat. Nostrud esse cillum culpa duis eu fugiat minim non Lorem culpa veniam. Ea id aute nulla exercitation.\r\n",
    "releaseDate": "2016-06-22T09:04:48 -06:00",
    "overview": [
      "occaecat labore nostrud quis nisi ex deserunt est",
      "tempor magna tempor tempor laboris veniam quis non",
      "laboris labore nisi nisi aliqua ex et eiusmod",
      "ut eu excepteur ex excepteur non esse irure",
      "ea adipisicing occaecat laboris nisi et incididunt duis"
    ]
  },
  {
    "courseId": "6356d111da34aab13b5b0f4e",
    "categoryId": 3,
    "price": "$2,878.95",
    "picture": "http://placehold.it/32x32",
    "rating": 4.49,
    "students": 33292,
    "instructor": "Trina Oneal",
    "courseName": "Complete C# Unity Game Developer 3D",
    "about": "Anim id reprehenderit officia in ad mollit ad minim exercitation voluptate adipisicing id laborum enim. Culpa pariatur mollit labore deserunt aliquip quis sit. Labore est dolore eu exercitation tempor incididunt eu ipsum eu culpa. Reprehenderit dolore proident consectetur quis sint elit ut eu laboris ex minim deserunt.\r\n",
    "releaseDate": "2014-05-06T10:52:43 -06:00",
    "overview": [
      "fugiat enim adipisicing anim cupidatat magna laboris commodo",
      "magna deserunt dolor et est consequat nisi laboris",
      "cillum occaecat deserunt et nulla do mollit deserunt",
      "sit voluptate irure enim et consectetur ipsum cillum",
      "irure officia anim consequat id aute qui consequat"
    ]
  },
  {
    "courseId": "6356d1110874083e201a4a38",
    "categoryId": 0,
    "price": "$3,129.49",
    "picture": "http://placehold.it/32x32",
    "rating": 4.32,
    "students": 23431,
    "instructor": "Dee Horn",
    "courseName": "React - The Complete Guide",
    "about": "Aliqua amet esse nostrud reprehenderit quis dolore Lorem id incididunt cupidatat amet. Veniam magna duis ad mollit fugiat. Ullamco veniam consectetur pariatur aute. Elit consectetur et ullamco nisi ipsum elit Lorem tempor aliquip exercitation sunt eiusmod ullamco. Dolor voluptate reprehenderit eu ut nisi elit. Aute sit est culpa laborum excepteur incididunt magna. Ipsum sint amet nisi qui enim nostrud consectetur adipisicing commodo non quis eu.\r\n",
    "releaseDate": "2017-10-05T12:02:43 -06:00",
    "overview": [
      "elit proident esse consequat irure excepteur aliquip ut",
      "nisi nostrud proident adipisicing commodo mollit nostrud laboris",
      "aliqua proident fugiat dolore ad et amet aliqua",
      "anim ex non aliquip officia reprehenderit minim quis",
      "incididunt ipsum cupidatat elit dolor voluptate fugiat nisi"
    ]
  },
  {
    "courseId": "6356d111d6d1756cfd2df869",
    "categoryId": 1,
    "price": "$3,053.42",
    "picture": "http://placehold.it/32x32",
    "rating": 4.79,
    "students": 5582,
    "instructor": "Diaz Massey",
    "courseName": "R For Data Science With Real Exercises",
    "about": "Aliqua enim laborum laborum minim amet officia eiusmod elit. Cillum est enim nisi fugiat. Magna nisi qui esse cupidatat in culpa tempor. Deserunt Lorem pariatur nulla minim voluptate tempor pariatur magna. Ut occaecat pariatur minim occaecat consequat consectetur eiusmod dolor voluptate laborum amet in. Irure minim duis labore esse aute culpa reprehenderit in proident incididunt culpa laborum eiusmod aliquip.\r\n",
    "releaseDate": "2014-10-30T10:22:51 -06:00",
    "overview": [
      "aliquip id qui consequat non do Lorem laborum",
      "veniam anim nisi est laborum elit elit eu",
      "officia mollit culpa sunt proident tempor dolore exercitation",
      "ipsum mollit elit laborum ut proident cupidatat amet",
      "excepteur magna exercitation occaecat amet aliqua enim ad"
    ]
  },
  {
    "courseId": "6356d111a657a2948885bd60",
    "categoryId": 2,
    "price": "$3,872.62",
    "picture": "http://placehold.it/32x32",
    "rating": 4.06,
    "students": 37607,
    "instructor": "Vickie Faulkner",
    "courseName": "The Complete Android N Developer Course",
    "about": "Do sit commodo duis do adipisicing enim pariatur. Sint mollit irure dolore commodo cillum est labore minim in laboris commodo ad. Proident esse sint excepteur anim proident anim sunt in et et ipsum proident. Adipisicing anim quis officia officia tempor commodo tempor. Pariatur est occaecat irure Lorem. Labore adipisicing anim commodo commodo ea sit magna dolore cupidatat nulla nulla ea esse.\r\n",
    "releaseDate": "2020-08-25T07:42:21 -06:00",
    "overview": [
      "enim ipsum qui adipisicing est id nisi magna",
      "est quis Lorem magna quis id voluptate enim",
      "cupidatat quis cupidatat magna ad ex pariatur non",
      "eu sit ad do nisi qui amet laboris",
      "et officia sunt esse amet dolor et laborum"
    ]
  }
]
